PEMEC_structured_mesh_channel/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  Field          | OpenFOAM: The Open Source CFD Toolbox           |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}

// phases
phases (water oxygen);

// water properties
water
{
    transportModel  Newtonian;
    nu              1e-06;
    rho             1000;
}

// oxygen properties
oxygen
{
    transportModel  Newtonian;
    nu              2e-05;
    rho             1.3;
}

// surface tension
sigma 0.072;
