PEMEC_structured_mesh_channel/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    div(rhoPhi,U)           Gauss upwind;

    div(phi,alpha)          Gauss vanLeer;
    div(phirb,alpha)        Gauss interfaceCompression;

    div(phi,U)              Gauss linearUpwind grad(U);

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default                 Gauss linear corrected;
}

interpolationSchemes
{
    default                 linear;
}

snGradSchemes
{
    default                 corrected;
}

fluxRequired
{
    default                 no;
    p_rgh;
    pcorr;
}
// ************************************************************************* //
